#### Terraform Plan 📖 ####
<details><summary>Show Plan</summary>

```terraform
tailscale_tailnet_key.main: Refreshing state... [id=kANHoGieHD11CNTRL]
oci_identity_compartment.platform: Refreshing state... [id=ocid1.compartment.oc1..aaaaaaaaxks7l2gcjjk3euzod7mzd22vc6bmczuqtto3f6z3aamcglgy2ujq]
data.oci_containerengine_cluster_option.main: Reading...
data.oci_core_services.all_services: Reading...
data.oci_identity_availability_domains.main: Reading...
oci_identity_group.managers: Refreshing state... [id=ocid1.group.oc1..aaaaaaaac7alsg5sta36d66mr4yflfdakygdxxusvnv54km3nznudlyvbaba]
oci_identity_user.manager: Refreshing state... [id=ocid1.user.oc1..aaaaaaaafxpfydig3om5bsydxijntrc64fbbjalgrjybqq6i2eihpjkxpzta]
oci_objectstorage_bucket.state: Refreshing state... [id=n/cnm7patunz1z/b/platform-state]
oci_budget_budget.main: Refreshing state... [id=ocid1.budget.oc1.ap-seoul-1.amaaaaaabsyhd7qa2wpumdq7peealllchr7ao5lcpkldzdgzgq7qoij4x2yq]
data.oci_core_services.all_services: Read complete after 1s [id=CoreServicesDataSource-0]
oci_core_public_ip.main: Refreshing state... [id=ocid1.publicip.oc1.ap-seoul-1.amaaaaaabsyhd7qafbingjhb7nxqn3qcaowsc7sgyi2trscfa6jzlhu7wvmq]
oci_logging_log_group.main: Refreshing state... [id=ocid1.loggroup.oc1.ap-seoul-1.amaaaaaabsyhd7qaqvtgvi64v26joo3vxbfpml4csr72nwk5cirrxqpjotda]
oci_ons_notification_topic.main: Refreshing state... [id=ocid1.onstopic.oc1.ap-seoul-1.amaaaaaabsyhd7qaitbrw7kzaoyqmbd5ld4hrjt6wss4fexrwgz4qngcknga]
oci_core_vcn.main: Refreshing state... [id=ocid1.vcn.oc1.ap-seoul-1.amaaaaaabsyhd7qazvdwifpfgn75iw5yxheajr5ng4esmlikj23v7ee2ef3q]
data.oci_identity_availability_domains.main: Read complete after 1s [id=IdentityAvailabilityDomainsDataSource-686890930]
data.oci_core_images.ubuntu: Reading...
oci_identity_policy.cluster: Refreshing state... [id=ocid1.policy.oc1..aaaaaaaagu6nbrnawfhjdwnrkfbzn6smo345m22gzfl55qxvxt7vep4yfqeq]
data.oci_containerengine_cluster_option.main: Read complete after 1s [id=ContainerengineClusterOptionDataSource-1870923232]
data.oci_identity_fault_domains.main: Reading...
oci_budget_alert_rule.main: Refreshing state... [id=ocid1.alertrule.oc1.ap-seoul-1.amaaaaaabsyhd7qajb44qwouyva4scc7ygfqdopoxjihlhbakqyetfr2wv2q]
oci_identity_user_group_membership.manager: Refreshing state... [id=ocid1.groupmembership.oc1..aaaaaaaa3mgwk4qef6qpqqgvi7duo7ep6ydxa6ionu4l5gx3vgffqaa3qutq]
oci_identity_policy.manager: Refreshing state... [id=ocid1.policy.oc1..aaaaaaaayhc5xs4li2w3l32btbgwn5bh6om3lyn2y2qiyvcrsebvbno4e6cq]
data.oci_identity_fault_domains.main: Read complete after 0s [id=IdentityFaultDomainsDataSource-2954258040]
oci_core_internet_gateway.main: Refreshing state... [id=ocid1.internetgateway.oc1.ap-seoul-1.aaaaaaaaonpjrtiqcayeevrkbiavrrjberaljszeqx3xxucgnczyyn34u4ka]
oci_core_nat_gateway.main: Refreshing state... [id=ocid1.natgateway.oc1.ap-seoul-1.aaaaaaaap7fljb33jz7xfhnm54leup5owryl6xen4fzgkvnjqdz3dtsoupkq]
oci_core_network_security_group.worker: Refreshing state... [id=ocid1.networksecuritygroup.oc1.ap-seoul-1.aaaaaaaaz5y4ozx4tv6f6r3vbymfmwgddettc25rc5w2afrg5libo3o662fq]
oci_core_service_gateway.main: Refreshing state... [id=ocid1.servicegateway.oc1.ap-seoul-1.aaaaaaaa6pdgo7kccqt4r4cs747knrxybmaz2xkcvdaqau6ztjc2rdm3tnba]
oci_core_network_security_group.cluster: Refreshing state... [id=ocid1.networksecuritygroup.oc1.ap-seoul-1.aaaaaaaargvnkigajohw6qvznbzlrdtmivyeaunrlx5dgeqvugie7xywtnea]
oci_core_network_security_group.bastion: Refreshing state... [id=ocid1.networksecuritygroup.oc1.ap-seoul-1.aaaaaaaayquhop5uavha3rpzt4lukx6kdpz6d6wraegzddtzahq4pnlwhzgq]
data.oci_core_images.ubuntu: Read complete after 1s [id=CoreImagesDataSource-675692870]
oci_core_route_table.public: Refreshing state... [id=ocid1.routetable.oc1.ap-seoul-1.aaaaaaaaf4htalzhwrxx4763yptthhd7oxu4schmuv2hq5u32xbi22pygdqq]
oci_ons_subscription.email: Refreshing state... [id=ocid1.onssubscription.oc1.ap-seoul-1.aaaaaaaaaarkzfrko5jnvzkbpad3c5fojdswzzu3u47ffxiisu4agl4rqwzq]
oci_monitoring_alarm.instance-memory: Refreshing state... [id=ocid1.alarm.oc1.ap-seoul-1.amaaaaaabsyhd7qas5de7mmyekowv2zsbw2oxqz6pjwpqa5awsttqhtf4o2q]
oci_monitoring_alarm.instance-cpu: Refreshing state... [id=ocid1.alarm.oc1.ap-seoul-1.amaaaaaabsyhd7qa6qx5fjp34nevhtdeneyqhjzt43stjxvzy6jip2gpcs6a]
oci_core_network_security_group_security_rule.bastion-to-global: Refreshing state... [id=5B12E3]
oci_core_network_security_group_security_rule.worker-to-global: Refreshing state... [id=903BB0]
oci_core_network_security_group_security_rule.worker-from-bastion: Refreshing state... [id=DE31C8]
oci_core_network_security_group_security_rule.worker-icmp: Refreshing state... [id=9C1E3C]
oci_core_network_security_group_security_rule.cluster-to-global: Refreshing state... [id=C704C9]
oci_core_network_security_group_security_rule.worker-from-worker: Refreshing state... [id=3CF182]
oci_core_network_security_group_security_rule.cluster-to-worker: Refreshing state... [id=8489A2]
oci_core_network_security_group_security_rule.cluster-from-worker-management: Refreshing state... [id=407CCB]
oci_core_network_security_group_security_rule.cluster-from-bastion: Refreshing state... [id=E359DE]
oci_core_network_security_group_security_rule.cluster-from-worker-api: Refreshing state... [id=A3A3FB]
oci_core_network_security_group_security_rule.worker-from-cluster: Refreshing state... [id=804EE8]
oci_core_subnet.public: Refreshing state... [id=ocid1.subnet.oc1.ap-seoul-1.aaaaaaaavvobrlojwajixsampnnqwjpnrwqrp23kp5kfnr3vxqxdluskhafq]
oci_logging_log.subnet-public: Refreshing state... [id=ocid1.log.oc1.ap-seoul-1.amaaaaaabsyhd7qahitcriuodikgvfgjk7qcjpapxg32de6zai6mtuuearca]
oci_load_balancer_load_balancer.main: Refreshing state... [id=ocid1.loadbalancer.oc1.ap-seoul-1.aaaaaaaatssba24t3l4kozqymaqhubbtif6sx65rdw4begr7nxwedmep46ga]
oci_core_route_table.private: Refreshing state... [id=ocid1.routetable.oc1.ap-seoul-1.aaaaaaaa2gdnpvg6ecx744a63vowlzaagbsqkmbb7wuf2i5lyyilfaesfpmq]
oci_logging_log.load-balancer-error: Refreshing state... [id=ocid1.log.oc1.ap-seoul-1.amaaaaaabsyhd7qa4ivpk7sbgrflajkzqxalmnmk47atcb3pbsnpl56y3i5a]
oci_monitoring_alarm.load-balancer-bandwidth: Refreshing state... [id=ocid1.alarm.oc1.ap-seoul-1.amaaaaaabsyhd7qaezb57s4mvb346pdiwznadug6uc4canyzrmt6qyjqkptq]
oci_logging_log.load-balancer-access: Refreshing state... [id=ocid1.log.oc1.ap-seoul-1.amaaaaaabsyhd7qawlujhtxaxz4drs7i4tojl4l5akflvqjsodbcghcz2nvq]
oci_monitoring_alarm.load-balancer-health: Refreshing state... [id=ocid1.alarm.oc1.ap-seoul-1.amaaaaaabsyhd7qa6bqigwre2ojntewig34hro6ggiddynjzbln4pkm6uoaa]
oci_core_subnet.private: Refreshing state... [id=ocid1.subnet.oc1.ap-seoul-1.aaaaaaaaz2zzw7w2kolrxzxelyfpu2lnsa6oths6txnblyewgc7wf3pr6dqq]
tailscale_acl.main: Refreshing state... [id=1b5d5621-19fb-f490-b890-5cba657914cf]
oci_logging_log.subnet-private: Refreshing state... [id=ocid1.log.oc1.ap-seoul-1.amaaaaaabsyhd7qalejvdxip7gkcra4rcyqknkchnfumj4j766annytvv4ba]
oci_containerengine_cluster.main: Refreshing state... [id=ocid1.cluster.oc1.ap-seoul-1.aaaaaaaav675okbokp7hx5psdy6mt2bstn6zvvgvxvcuipmrvcxsuzj32fmq]
oci_core_instance.bastion: Refreshing state... [id=ocid1.instance.oc1.ap-seoul-1.anuwgljrbsyhd7qcrxmlulolu4tzvap7fgqnkmyhieqcmmbeo6eqktuawniq]
data.oci_containerengine_cluster_kube_config.main: Reading...
data.oci_containerengine_node_pool_option.main: Reading...
data.oci_containerengine_cluster_kube_config.main: Read complete after 0s [id=ContainerengineClusterKubeConfigDataSource-3656204518]
data.oci_containerengine_node_pool_option.main: Read complete after 1s [id=ContainerengineNodePoolOptionDataSource-3381421671]
oci_containerengine_node_pool.main: Refreshing state... [id=ocid1.nodepool.oc1.ap-seoul-1.aaaaaaaan674whrp5r7gjgbl3g3fvvpyfrnrg523vn3cs7vmtnz7pmrrmlia]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # helm_release.prometheus will be created
  + resource "helm_release" "prometheus" {
      + atomic                     = false
      + chart                      = "kube-prometheus-stack"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "prometheus"
      + namespace                  = "system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://prometheus-community.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + jsonencode(
                {
                  + alertmanager       = {
                      + enabled = false
                    }
                  + grafana            = {
                      + enabled           = true
                      + priorityClassName = "system-priority"
                      + resources         = {
                          + limits   = {
                              + cpu    = "200m"
                              + memory = "512Mi"
                            }
                          + requests = {
                              + cpu    = "100m"
                              + memory = "256Mi"
                            }
                        }
                    }
                  + prometheus         = {
                      + prometheusSpec = {
                          + priorityClassName = "system-priority"
                          + resources         = {
                              + limits   = {
                                  + cpu    = "400m"
                                  + memory = "2Gi"
                                }
                              + requests = {
                                  + cpu    = "400m"
                                  + memory = "2Gi"
                                }
                            }
                          + retention         = "3d"
                          + storageSpec       = {
                              + emptyDir = {
                                  + medium = "Memory"
                                }
                            }
                        }
                    }
                  + prometheusOperator = {
                      + resources = {
                          + limits   = {
                              + cpu    = "100m"
                              + memory = "256Mi"
                            }
                          + requests = {
                              + cpu    = "50m"
                              + memory = "128Mi"
                            }
                        }
                    }
                }
            ),
        ]
      + verify                     = false
      + version                    = "68.2.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.traefik will be created
  + resource "helm_release" "traefik" {
      + atomic                     = false
      + chart                      = "traefik"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "traefik"
      + namespace                  = "system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://traefik.github.io/charts"
      + reset_values               = false
      + reuse_values               = false
      + set                        = [
          + {
              + name  = "deployment.replicas"
              + value = "2"
                # (1 unchanged attribute hidden)
            },
          + {
              + name  = "priorityClassName"
              + value = "system-priority"
                # (1 unchanged attribute hidden)
            },
          + {
              + name  = "deployment.podAntiAffinity.preferredDuringSchedulingIgnoredDuringExecution.0.weight"
              + value = "100"
                # (1 unchanged attribute hidden)
            },
          + {
              + name  = "deployment.podAntiAffinity.preferredDuringSchedulingIgnoredDuringExecution.0.podAffinityTerm.labelSelector.matchExpressions.0.key"
              + value = "app.kubernetes.io/name"
                # (1 unchanged attribute hidden)
            },
          + {
              + name  = "deployment.podAntiAffinity.preferredDuringSchedulingIgnoredDuringExecution.0.podAffinityTerm.labelSelector.matchExpressions.0.operator"
              + value = "In"
                # (1 unchanged attribute hidden)
            },
          + {
              + name  = "deployment.podAntiAffinity.preferredDuringSchedulingIgnoredDuringExecution.0.podAffinityTerm.labelSelector.matchExpressions.0.values.0"
              + value = "traefik"
                # (1 unchanged attribute hidden)
            },
          + {
              + name  = "deployment.podAntiAffinity.preferredDuringSchedulingIgnoredDuringExecution.0.podAffinityTerm.topologyKey"
              + value = "kubernetes.io/hostname"
                # (1 unchanged attribute hidden)
            },
        ]
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + jsonencode(
                {
                  + resources = {
                      + limits   = {
                          + cpu    = "200m"
                          + memory = "512Mi"
                        }
                      + requests = {
                          + cpu    = "100m"
                          + memory = "256Mi"
                        }
                    }
                  + service   = {
                      + annotations = {
                          + "service.beta.kubernetes.io/oci-load-balancer-internal"       = "false"
                          + "service.beta.kubernetes.io/oci-load-balancer-ip-address"     = "YOUR_RESERVED_PUBLIC_IP"
                          + "service.beta.kubernetes.io/oci-load-balancer-shape"          = "flexible"
                          + "service.beta.kubernetes.io/oci-load-balancer-shape-flex-max" = "10"
                          + "service.beta.kubernetes.io/oci-load-balancer-shape-flex-min" = "10"
                        }
                    }
                }
            ),
        ]
      + verify                     = false
      + version                    = "34.0.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # kubernetes_limit_range_v1.dev will be created
  + resource "kubernetes_limit_range_v1" "dev" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "limit-dev"
          + namespace        = "dev"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + limit {
              + default         = {
                  + "cpu"    = "300m"
                  + "memory" = "512Mi"
                }
              + default_request = {
                  + "cpu"    = "50m"
                  + "memory" = "128Mi"
                }
              + type            = "Container"
            }
        }
    }

  # kubernetes_limit_range_v1.main will be created
  + resource "kubernetes_limit_range_v1" "main" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "limit-main"
          + namespace        = "main"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + limit {
              + default         = {
                  + "cpu"    = "1500m"
                  + "memory" = "3Gi"
                }
              + default_request = {
                  + "cpu"    = "100m"
                  + "memory" = "512Mi"
                }
              + type            = "Container"
            }
        }
    }

  # kubernetes_limit_range_v1.system will be created
  + resource "kubernetes_limit_range_v1" "system" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "limit-system"
          + namespace        = "system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + limit {
              + default         = {
                  + "cpu"    = "1000m"
                  + "memory" = "3Gi"
                }
              + default_request = {
                  + "cpu"    = "100m"
                  + "memory" = "128Mi"
                }
              + type            = "Container"
            }
        }
    }

  # kubernetes_namespace_v1.dev will be created
  + resource "kubernetes_namespace_v1" "dev" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "dev"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_namespace_v1.main will be created
  + resource "kubernetes_namespace_v1" "main" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "main"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_namespace_v1.system will be created
  + resource "kubernetes_namespace_v1" "system" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_priority_class_v1.dev will be created
  + resource "kubernetes_priority_class_v1" "dev" {
      + global_default    = false
      + id                = (known after apply)
      + preemption_policy = "PreemptLowerPriority"
      + value             = 1

      + metadata {
          + generation       = (known after apply)
          + name             = "priority-dev"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_priority_class_v1.main will be created
  + resource "kubernetes_priority_class_v1" "main" {
      + global_default    = false
      + id                = (known after apply)
      + preemption_policy = "PreemptLowerPriority"
      + value             = 10

      + metadata {
          + generation       = (known after apply)
          + name             = "priority-main"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_priority_class_v1.system will be created
  + resource "kubernetes_priority_class_v1" "system" {
      + global_default    = false
      + id                = (known after apply)
      + preemption_policy = "PreemptLowerPriority"
      + value             = 100

      + metadata {
          + generation       = (known after apply)
          + name             = "priority-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_resource_quota_v1.dev will be created
  + resource "kubernetes_resource_quota_v1" "dev" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "quota-dev"
          + namespace        = "dev"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + hard = {
              + "limits.cpu"      = "1000m"
              + "limits.memory"   = "2Gi"
              + "requests.cpu"    = "600m"
              + "requests.memory" = "1.5Gi"
            }
        }
    }

  # kubernetes_resource_quota_v1.main will be created
  + resource "kubernetes_resource_quota_v1" "main" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "quota-main"
          + namespace        = "main"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + hard = {
              + "limits.cpu"      = "8000m"
              + "limits.memory"   = "20Gi"
              + "requests.cpu"    = "5000m"
              + "requests.memory" = "13Gi"
            }
        }
    }

  # kubernetes_resource_quota_v1.system will be created
  + resource "kubernetes_resource_quota_v1" "system" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "quota-system"
          + namespace        = "system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + hard = {
              + "limits.cpu"      = "3000m"
              + "limits.memory"   = "8Gi"
              + "requests.cpu"    = "1500m"
              + "requests.memory" = "5Gi"
            }
        }
    }

Plan: 14 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @ensia96, Action: `pull_request`*